# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Definitions..::..Item Property
Definitions Class See Also
---
Retrieves a definition by a given name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Definition this[
	string name
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Item ( _
	name As String _
) As Definition
	Get
```

Visual C++
---
```text
public:
property Definition^ Item[String^ name] {
	Definition^ get (String^ name);
}
```

# ### Parameters
name
    Type: System..::..StringThe name of the parameter definition for which to search.
# Remarks
If the definition is not found then nullNothingnullptra null reference (Nothing in Visual Basic) will be returned.
# See Also
Definitions Class
Autodesk.Revit.DB Namespace